Stairs nosing profile must have one loop. Wrong profile will not be shown in profiles list in Stairs Type properties.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BadNosingProfile { get; }
  Visual Basic
Public Shared ReadOnly Property BadNosingProfile As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BadNosingProfile {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace